In Linear Regression (2) (part1). we will slice the dataframe and prepare it to use it in Linear Regression (2) (part2)

In [1]:
#Import libraries
import pandas as pd

In [2]:
#Load dataset
df = pd.read_csv('w-h.csv')

In [3]:
#Change to Data Frame Variable
Height=pd.DataFrame(df['Height'])
Weight=pd.DataFrame(df['Weight'])
Gender=pd.DataFrame(df['Gender'])

In [4]:
df.head(9)

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801
5   Male  67.253016  152.212156
6   Male  68.785081  183.927889
7   Male  68.348516  167.971110
8   Male  67.018950  175.929440

In [5]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [6]:
df.shape

(10000, 3)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
Gender    10000 non-null object
Height    10000 non-null float64
Weight    10000 non-null float64
dtypes: float64(2), object(1)
memory usage: 234.5+ KB

In [8]:
# Checking for missing values in th Gender Column
df.Gender.isnull().sum()

0

In [14]:
# Checking for missing values in the Height Column
df.Height.isnull().sum()

0

In [15]:
# Checking for missing values in the Weight Column
df.Weight.isnull().sum()

0

In [16]:
Gender

      Gender
0       Male
1       Male
2       Male
3       Male
4       Male
...      ...
9995  Female
9996  Female
9997  Female
9998  Female
9999  Female

[10000 rows x 1 columns]

Slice the values for the Male users only

In [17]:
df2 = df[df.Gender == 'Male']

In [18]:
df2.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [12]:
df2.to_csv('newhw.csv')

In [13]:
df3 = pd.read_csv('newhw.csv')